# Objective : Combining DataFrames
<hr>

1. Concatenate
2. Append
3. Database Style Merge
4. Database Style Join
5. Working on TimeSeries Data

<hr>

### 1. Concatenate

In [1]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})

In [6]:
df2 = pd.DataFrame({'A':[11,12,13],'B':[14,15,16],'C':[17,18,19]})

In [7]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
df2

    A   B   C
0  11  14  17
1  12  15  18
2  13  16  19

* Combining dataframes
* Index is not reset
* Default axis is 0

In [11]:
pd.concat([df1,df2])

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  11  14  17
1  12  15  18
2  13  16  19

* Resetting index

In [13]:
pd.concat([df1,df2],ignore_index=True)

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
3  11  14  17
4  12  15  18
5  13  16  19

* Concatenating rows
* It uses index to identify row of concatenation

In [12]:
pd.concat([df1,df2],axis=1)

   A  B  C   A   B   C
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19

In [14]:
df2 = pd.DataFrame({'A':[11,12,13],'B':[14,15,16],'C':[17,18,19]}, index=[2,3,4])

In [15]:
df2

    A   B   C
2  11  14  17
3  12  15  18
4  13  16  19

* By default, outer join is done

In [16]:
pd.concat([df1,df2],axis=1)

     A    B    C     A     B     C
0  1.0  4.0  7.0   NaN   NaN   NaN
1  2.0  5.0  8.0   NaN   NaN   NaN
2  3.0  6.0  9.0  11.0  14.0  17.0
3  NaN  NaN  NaN  12.0  15.0  18.0
4  NaN  NaN  NaN  13.0  16.0  19.0

* Switching to inner join

In [17]:
pd.concat([df1,df2],axis=1,join='inner')

   A  B  C   A   B   C
2  3  6  9  11  14  17

* Retaining dataframe information after merging

In [20]:
pd.concat([df1,df2], keys=['df1','df2'])

        A   B   C
df1 0   1   4   7
    1   2   5   8
    2   3   6   9
df2 2  11  14  17
    3  12  15  18
    4  13  16  19

### 2. Append
* Predated to concat
* Avoid append & prefer concat

### 3. Merge
* pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL.
* These methods perform significantly better (in some cases well over an order of magnitude better) than other open source implementations (like base::merge.data.frame in R).
* The reason for this is careful algorithmic design and the internal layout of the data in DataFrame.

#### Type of merges
* one-to-one : for example when joining two DataFrame objects on their indexes (which must contain unique values).
* many-to-one : for example when joining an index (unique) to one or more columns in a different DataFrame. 
* many-to-many : joining columns on columns.

In [24]:
df1 = pd.DataFrame({'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})

In [25]:
df2 = pd.DataFrame({'A':[1,2,3],'D':[14,15,16],'E':[17,18,19]})

In [26]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [27]:
df2

   A   D   E
0  1  14  17
1  2  15  18
2  3  16  19

* This validates one-to-one mapping
* Explicitly tells column A

In [30]:
df1.merge(df2, on='A', validate='one_to_one')

   A  B  C   D   E
0  1  4  7  14  17
1  2  5  8  15  18
2  3  6  9  16  19

In [31]:
df2 = pd.DataFrame({'A':[2,2,3],'D':[14,15,16],'E':[17,18,19]})

In [32]:
df1.merge(df2, on='A', validate='one_to_one')

MergeError: Merge keys are not unique in right dataset; not a one-to-one merge

* left   : LEFT OUTER JOIN    : Use keys from left frame only
* right  : RIGHT OUTER JOIN   : Use keys from right frame only
* outer  : FULL OUTER JOIN    : Use union of keys from both frames
* inner  : INNER JOIN         : Use intersection of keys from both frames : default

* Validating one to many join
* We are doing outer join

In [36]:
df1.merge(df2, on='A', validate='one_to_many', how='outer')

   A  B  C     D     E
0  1  4  7   NaN   NaN
1  2  5  8  14.0  17.0
2  2  5  8  15.0  18.0
3  3  6  9  16.0  19.0

In [37]:
df1.merge(df2, on='A', validate='one_to_many', how='inner')

   A  B  C   D   E
0  2  5  8  14  17
1  2  5  8  15  18
2  3  6  9  16  19

* Another way of doing this

In [39]:
pd.merge(df1,df2,on=['A'])

   A  B  C   D   E
0  2  5  8  14  17
1  2  5  8  15  18
2  3  6  9  16  19

In [40]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [41]:
df2 = pd.DataFrame({'A':[2,2,3],'D':[1,2,3],'E':[17,18,19]})

In [42]:
df2

   A  D   E
0  2  1  17
1  2  2  18
2  3  3  19

* Working on two different columns of dataframes
* Adding different suffixes to distinguish data

In [46]:
df1.merge(df2,left_on='A',right_on='D', suffixes=['_df1','_df2'])

   A_df1  B  C  A_df2  D   E
0      1  4  7      2  1  17
1      2  5  8      2  2  18
2      3  6  9      3  3  19

### 4. Join
* This is a convenient method for combining the columns DataFrames into a single result DataFrame

In [47]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [48]:
df2

   A  D   E
0  2  1  17
1  2  2  18
2  3  3  19

In [52]:
df1.join(df2,lsuffix='_df1',rsuffix='_df2')

   A_df1  B  C  A_df2  D   E
0      1  4  7      2  1  17
1      2  5  8      2  2  18
2      3  6  9      3  3  19

### 5. TimeSeries Friendly Operations
* merge_ordered : Merging ordered data like time series

In [55]:
df1 = pd.DataFrame({'Date':pd.date_range('2000', freq='D', periods=3), 'Sales':[10,20,30]} )

In [56]:
df1

        Date  Sales
0 2000-01-01     10
1 2000-01-02     20
2 2000-01-03     30

In [66]:
df2 = pd.DataFrame({'Date':pd.date_range('2001', freq='D', periods=3), 'Sales':[20,40,50]} )

In [67]:
df2

        Date  Sales
0 2001-01-01     20
1 2001-01-02     40
2 2001-01-03     50

In [68]:
pd.merge_ordered(df1,df2)

        Date  Sales
0 2000-01-01     10
1 2000-01-02     20
2 2000-01-03     30
3 2001-01-01     20
4 2001-01-02     40
5 2001-01-03     50

In [69]:
pd.merge_ordered(df1,df2,suffixes=['_df1','_df2'], on='Date')

        Date  Sales_df1  Sales_df2
0 2000-01-01       10.0        NaN
1 2000-01-02       20.0        NaN
2 2000-01-03       30.0        NaN
3 2001-01-01        NaN       20.0
4 2001-01-02        NaN       40.0
5 2001-01-03        NaN       50.0

* merge_asof :  is similar to an ordered left-join except that we match on nearest key rather than equal keys. For each row in the left DataFrame, we select the last row in the right DataFrame whose on key is less than the lefts key. Both DataFrames must be sorted by the key.

In [70]:
trades = pd.DataFrame({
        'time': pd.to_datetime(['20160525 13:30:00.023',
                                '20160525 13:30:00.038',
                                '20160525 13:30:00.048',
                                '20160525 13:30:00.048',
                                '20160525 13:30:00.048']),
        'ticker': ['MSFT', 'MSFT',
                   'GOOG', 'GOOG', 'AAPL'],
        'price': [51.95, 51.95,
                  720.77, 720.92, 98.00],
        'quantity': [75, 155,
                     100, 100, 100]},
        columns=['time', 'ticker', 'price', 'quantity'])

In [71]:
trades

                     time ticker   price  quantity
0 2016-05-25 13:30:00.023   MSFT   51.95        75
1 2016-05-25 13:30:00.038   MSFT   51.95       155
2 2016-05-25 13:30:00.048   GOOG  720.77       100
3 2016-05-25 13:30:00.048   GOOG  720.92       100
4 2016-05-25 13:30:00.048   AAPL   98.00       100

In [72]:
quotes = pd.DataFrame({
        'time': pd.to_datetime(['20160525 13:30:00.023',
                                '20160525 13:30:00.023',
                                '20160525 13:30:00.030',
                                '20160525 13:30:00.041',
                                '20160525 13:30:00.048',
                                '20160525 13:30:00.049',
                                '20160525 13:30:00.072',
                                '20160525 13:30:00.075']),
        'ticker': ['GOOG', 'MSFT', 'MSFT',
                   'MSFT', 'GOOG', 'AAPL', 'GOOG',
                   'MSFT'],
        'bid': [720.50, 51.95, 51.97, 51.99,
                720.50, 97.99, 720.50, 52.01],
        'ask': [720.93, 51.96, 51.98, 52.00,
                720.93, 98.01, 720.88, 52.03]},
        columns=['time', 'ticker', 'bid', 'ask'])

In [73]:
quotes

                     time ticker     bid     ask
0 2016-05-25 13:30:00.023   GOOG  720.50  720.93
1 2016-05-25 13:30:00.023   MSFT   51.95   51.96
2 2016-05-25 13:30:00.030   MSFT   51.97   51.98
3 2016-05-25 13:30:00.041   MSFT   51.99   52.00
4 2016-05-25 13:30:00.048   GOOG  720.50  720.93
5 2016-05-25 13:30:00.049   AAPL   97.99   98.01
6 2016-05-25 13:30:00.072   GOOG  720.50  720.88
7 2016-05-25 13:30:00.075   MSFT   52.01   52.03

* Outcome of Regular merge

In [79]:
trades.merge(quotes, on=['time','ticker'])

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
2 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93

* Merging on approximate value
* Merging on nearest value

In [80]:
pd.merge_asof(trades, quotes,
                  on='time',
                  by='ticker', direction='nearest')

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.038   MSFT   51.95       155   51.99   52.00
2 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
3 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93
4 2016-05-25 13:30:00.048   AAPL   98.00       100   97.99   98.01

* Putting limit on Merged value

In [76]:
pd.merge_asof(trades, quotes,
                  on='time',
                  by='ticker', tolerance=pd.Timedelta('2ms'))

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.038   MSFT   51.95       155     NaN     NaN
2 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
3 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93
4 2016-05-25 13:30:00.048   AAPL   98.00       100     NaN     NaN